<a href="https://colab.research.google.com/github/mjayashri/machine-learning-refresher/blob/main/pandas_refresher.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Panda Series
Panda series are similar to numpy array but it can have axis labels which can be number or any python object

In [71]:
import numpy as np
import pandas as pd

In [72]:
## help(pd.Series)

### Indexes and Data List

In [73]:
indexx = ["USA", "India", "China"]
data = [1000,2000,3000]

In [74]:
my_series = pd.Series(data=data)

In [75]:
my_series

0    1000
1    2000
2    3000
dtype: int64

In [76]:
pd.Series(data=data,index=indexx)

USA      1000
India    2000
China    3000
dtype: int64

In [77]:
random_data = np.random.randint(0,10,3)

In [78]:
random_data

array([8, 8, 1])

In [79]:
names = ["A","B","C"]
names

['A', 'B', 'C']

In [80]:
age_series = pd.Series(random_data,names)

In [81]:
age_series

A    8
B    8
C    1
dtype: int64

### From dictionary

In [82]:
ages = {"A":10,"B":20,"C":30}

In [83]:
ages

{'A': 10, 'B': 20, 'C': 30}

In [84]:
pd.Series(ages)

A    10
B    20
C    30
dtype: int64

### Named Index

In [85]:
q1 = { "japan": 80, "china": 450, "india": 200, "usa": 250 }
q2 = { "japan": 100, "china": 500, "india": 210,"Brazil": 300 }

sales_q1 = pd.Series(q1)
sales_q2 = pd.Series(q2)

In [86]:
sales_q1

japan     80
china    450
india    200
usa      250
dtype: int64

In [87]:
sales_q2["japan"]

100

In [88]:
sales_q2[0]

<ipython-input-88-b085e0732aa1>:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  sales_q2[0]

100

### Operations

In [89]:
sales_q1 * 3

japan     240
china    1350
india     600
usa       750
dtype: int64

In [90]:
sales_q1

japan     80
china    450
india    200
usa      250
dtype: int64

In [91]:
sales_q1 / 10

japan     8.0
china    45.0
india    20.0
usa      25.0
dtype: float64

### Between Series

In [92]:
sales_q1 + sales_q2

Brazil      NaN
china     950.0
india     410.0
japan     180.0
usa         NaN
dtype: float64

In [93]:
sales_q1.add(sales_q2)

Brazil      NaN
china     950.0
india     410.0
japan     180.0
usa         NaN
dtype: float64

In [94]:
sales_q1.add(sales_q2, fill_value= 100)

Brazil    400.0
china     950.0
india     410.0
japan     180.0
usa       350.0
dtype: float64

In [95]:
%%capture
sales_q1